RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6300/ip/hpm_dac_regs.h
/*
 * DAC_CONFIG (RW)
 *
 */
#define DAC_ANA_CFG0_DAC_CONFIG_MASK (0xF0U)
#define DAC_ANA_CFG0_DAC_CONFIG_SHIFT (4U)
#define DAC_ANA_CFG0_DAC_CONFIG_SET(x) (((uint32_t)(x) << DAC_ANA_CFG0_DAC_CONFIG_SHIFT) & DAC_ANA_CFG0_DAC_CONFIG_MASK)
#define DAC_ANA_CFG0_DAC_CONFIG_GET(x) (((uint32_t)(x) & DAC_ANA_CFG0_DAC_CONFIG_MASK) >> DAC_ANA_CFG0_DAC_CONFIG_SHIFT)

/*
 * CALI_DELTA_V_CFG (RW)
 *
 */
#define DAC_ANA_CFG0_CALI_DELTA_V_CFG_MASK (0xCU)
#define DAC_ANA_CFG0_CALI_DELTA_V_CFG_SHIFT (2U)
#define DAC_ANA_CFG0_CALI_DELTA_V_CFG_SET(x) (((uint32_t)(x) << DAC_ANA_CFG0_CALI_DELTA_V_CFG_SHIFT) & DAC_ANA_CFG0_CALI_DELTA_V_CFG_MASK)
#define DAC_ANA_CFG0_CALI_DELTA_V_CFG_GET(x) (((uint32_t)(x) & DAC_ANA_CFG0_CALI_DELTA_V_CFG_MASK) >> DAC_ANA_CFG0_CALI_DELTA_V_CFG_SHIFT)

/*
 * BYPASS_CALI_GM (RW)
 *
 */
#define DAC_ANA_CFG0_BYPASS_CALI_GM_MASK (0x2U)
#define DAC_ANA_CFG0_BYPASS_CALI_GM_SHIFT (1U)
#define DAC_ANA_CFG0_BYPASS_CALI_GM_SET(x) (((uint32_t)(x) << DAC_ANA_CFG0_BYPASS_CALI_GM_SHIFT) & DAC_ANA_CFG0_BYPASS_CALI_GM_MASK)
#define DAC_ANA_CFG0_BYPASS_CALI_GM_GET(x) (((uint32_t)(x) & DAC_ANA_CFG0_BYPASS_CALI_GM_MASK) >> DAC_ANA_CFG0_BYPASS_CALI_GM_SHIFT)

/*
 * DAC12BIT_EN (RW)
 *
 */
#define DAC_ANA_CFG0_DAC12BIT_EN_MASK (0x1U)
#define DAC_ANA_CFG0_DAC12BIT_EN_SHIFT (0U)
#define DAC_ANA_CFG0_DAC12BIT_EN_SET(x) (((uint32_t)(x) << DAC_ANA_CFG0_DAC12BIT_EN_SHIFT) & DAC_ANA_CFG0_DAC12BIT_EN_MASK)
#define DAC_ANA_CFG0_DAC12BIT_EN_GET(x) (((uint32_t)(x) & DAC_ANA_CFG0_DAC12BIT_EN_MASK) >> DAC_ANA_CFG0_DAC12BIT_EN_SHIFT)

/* Bitfield definition for register: CFG0_BAK */
/*
 * SW_DAC_DATA (RW)
 *
 * dac data used in direct mode(dac_mode==2'b10)
 */
#define DAC_CFG0_BAK_SW_DAC_DATA_MASK (0xFFF0000UL)
#define DAC_CFG0_BAK_SW_DAC_DATA_SHIFT (16U)
#define DAC_CFG0_BAK_SW_DAC_DATA_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_SW_DAC_DATA_SHIFT) & DAC_CFG0_BAK_SW_DAC_DATA_MASK)
#define DAC_CFG0_BAK_SW_DAC_DATA_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_SW_DAC_DATA_MASK) >> DAC_CFG0_BAK_SW_DAC_DATA_SHIFT)

/*
 * DMA_AHB_EN (RW)
 *
 * set to enable internal DMA, it will read one burst if enough space in FIFO.
 * Should only be used in buffer mode.
 */
#define DAC_CFG0_BAK_DMA_AHB_EN_MASK (0x200U)
#define DAC_CFG0_BAK_DMA_AHB_EN_SHIFT (9U)
#define DAC_CFG0_BAK_DMA_AHB_EN_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_DMA_AHB_EN_SHIFT) & DAC_CFG0_BAK_DMA_AHB_EN_MASK)
#define DAC_CFG0_BAK_DMA_AHB_EN_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_DMA_AHB_EN_MASK) >> DAC_CFG0_BAK_DMA_AHB_EN_SHIFT)

/*
 * SYNC_MODE (RW)
 *
 * 1: sync dac clock and ahb clock.
 *   all HW trigger signals are pulse in sync mode, can get faster response;
 * 0: async dac clock and ahb_clock
 *   all HW trigger signals should be level and should be more than one dac clock cycle,  used to get accurate output frequency(which may not be divided from AHB clock)
 */
#define DAC_CFG0_BAK_SYNC_MODE_MASK (0x100U)
#define DAC_CFG0_BAK_SYNC_MODE_SHIFT (8U)
#define DAC_CFG0_BAK_SYNC_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_SYNC_MODE_SHIFT) & DAC_CFG0_BAK_SYNC_MODE_MASK)
#define DAC_CFG0_BAK_SYNC_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_SYNC_MODE_MASK) >> DAC_CFG0_BAK_SYNC_MODE_SHIFT)

/*
 * TRIG_MODE (RW)
 *
 * 0: single mode, one trigger pulse will send one 12bit data to DAC analog;
 * 1: continual mode, if trigger signal(either  or HW) is set, DAC will send data if FIFO is not empty, if trigger signal is clear, DAC will stop send data.
 */
#define DAC_CFG0_BAK_TRIG_MODE_MASK (0x80U)
#define DAC_CFG0_BAK_TRIG_MODE_SHIFT (7U)
#define DAC_CFG0_BAK_TRIG_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_TRIG_MODE_SHIFT) & DAC_CFG0_BAK_TRIG_MODE_MASK)
#define DAC_CFG0_BAK_TRIG_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_TRIG_MODE_MASK) >> DAC_CFG0_BAK_TRIG_MODE_SHIFT)

/*
 * HW_TRIG_EN (RW)
 *
 * set to use trigger signal from trigger_mux, user should config it to pulse in single mode, and level in continual mode
 */
#define DAC_CFG0_BAK_HW_TRIG_EN_MASK (0x40U)
#define DAC_CFG0_BAK_HW_TRIG_EN_SHIFT (6U)
#define DAC_CFG0_BAK_HW_TRIG_EN_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_HW_TRIG_EN_SHIFT) & DAC_CFG0_BAK_HW_TRIG_EN_MASK)
#define DAC_CFG0_BAK_HW_TRIG_EN_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_HW_TRIG_EN_MASK) >> DAC_CFG0_BAK_HW_TRIG_EN_SHIFT)

/*
 * DAC_MODE (RW)
 *
 * 00: direct mode, DAC output the fixed configured data(from sw_dac_data)
 * 01: step mode, DAC output from start_point to end point, with configured step, can step up or step down
 * 10: buffer mode,  read data from buffer, then output to analog, internal DMA will load next burst if enough space in local FIFO;
 */
#define DAC_CFG0_BAK_DAC_MODE_MASK (0x30U)
#define DAC_CFG0_BAK_DAC_MODE_SHIFT (4U)
#define DAC_CFG0_BAK_DAC_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_DAC_MODE_SHIFT) & DAC_CFG0_BAK_DAC_MODE_MASK)
#define DAC_CFG0_BAK_DAC_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_DAC_MODE_MASK) >> DAC_CFG0_BAK_DAC_MODE_SHIFT)

/*
 * BUF_DATA_MODE (RW)
 *
 * data structure for buffer mode,
 * 0: each 32-bit data contains 2 points, b11:0 for first, b27:16 for second.
 * 1: each 32-bit data contains 1 point, b11:0 for first
 */
#define DAC_CFG0_BAK_BUF_DATA_MODE_MASK (0x8U)
#define DAC_CFG0_BAK_BUF_DATA_MODE_SHIFT (3U)
#define DAC_CFG0_BAK_BUF_DATA_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_BUF_DATA_MODE_SHIFT) & DAC_CFG0_BAK_BUF_DATA_MODE_MASK)
#define DAC_CFG0_BAK_BUF_DATA_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_BUF_DATA_MODE_MASK) >> DAC_CFG0_BAK_BUF_DATA_MODE_SHIFT)

/*
 * HBURST_CFG (RW)
 *
 * DAC support following fixed burst only
 * 000-SINGLE;  011-INCR4;  101: INCR8
 * others are reserved
 */
#define DAC_CFG0_BAK_HBURST_CFG_MASK (0x7U)
#define DAC_CFG0_BAK_HBURST_CFG_SHIFT (0U)
#define DAC_CFG0_BAK_HBURST_CFG_SET(x) (((uint32_t)(x) << DAC_CFG0_BAK_HBURST_CFG_SHIFT) & DAC_CFG0_BAK_HBURST_CFG_MASK)
#define DAC_CFG0_BAK_HBURST_CFG_GET(x) (((uint32_t)(x) & DAC_CFG0_BAK_HBURST_CFG_MASK) >> DAC_CFG0_BAK_HBURST_CFG_SHIFT)

/* Bitfield definition for register: STATUS0 */
/*
 * CUR_BUF_OFFSET (RW)
 *
 */
#define DAC_STATUS0_CUR_BUF_OFFSET_MASK (0xFFFF00UL)
#define DAC_STATUS0_CUR_BUF_OFFSET_SHIFT (8U)
#define DAC_STATUS0_CUR_BUF_OFFSET_SET(x) (((uint32_t)(x) << DAC_STATUS0_CUR_BUF_OFFSET_SHIFT) & DAC_STATUS0_CUR_BUF_OFFSET_MASK)
#define DAC_STATUS0_CUR_BUF_OFFSET_GET(x) (((uint32_t)(x) & DAC_STATUS0_CUR_BUF_OFFSET_MASK) >> DAC_STATUS0_CUR_BUF_OFFSET_SHIFT)

/*
 * CUR_BUF_INDEX (RW)
 *
 */
#define DAC_STATUS0_CUR_BUF_INDEX_MASK (0x80U)
#define DAC_STATUS0_CUR_BUF_INDEX_SHIFT (7U)
#define DAC_STATUS0_CUR_BUF_INDEX_SET(x) (((uint32_t)(x) << DAC_STATUS0_CUR_BUF_INDEX_SHIFT) & DAC_STATUS0_CUR_BUF_INDEX_MASK)
#define DAC_STATUS0_CUR_BUF_INDEX_GET(x) (((uint32_t)(x) & DAC_STATUS0_CUR_BUF_INDEX_MASK) >> DAC_STATUS0_CUR_BUF_INDEX_SHIFT)



/* STEP_CFG register group index macro definition */
#define DAC_STEP_CFG_STEP0 (0UL)
#define DAC_STEP_CFG_STEP1 (1UL)
#define DAC_STEP_CFG_STEP2 (2UL)
#define DAC_STEP_CFG_STEP3 (3UL)

/* BUF_ADDR register group index macro definition */
#define DAC_BUF_ADDR_BUF0 (0UL)
#define DAC_BUF_ADDR_BUF1 (1UL)


#endif /* HPM_DAC_H */
